[
  {
    "name": "Henry Forrest",
    "summary": "Henry Forrest or Forres, was a Scottish martyr.",
    "text": [
      "Henry Forrest was executed in St Andrews around 1533 for expressing Protestant views. Much of his career is uncertain. He seems to have studied at St Leonard’s College in the 1520s, and was perhaps in St Andrews at the time of Patrick Hamilton’s execution. Forrest supposedly became a Benedictine monk, but sympathised with Patrick Hamilton’s ideas. He is also believed to have owned a copy of the New Testament in English – something which at that time was forbidden. Forrest was tried for heresy in St Andrews Cathedral and condemned to be burnt at the stake. He was killed near the cliffs to the north of the Cathedral, with the site being chosen so that the fire could be seen along the coast in Angus."
    ],
    "references": [
      "St Leonard’s College",
      "Patrick Hamilton",
      "Cathedral"
    ]
  },
  {
    "name": "Patrick Hamilton",
    "summary": "",
    "text": [
      "Patrick Hamilton was the first person to be executed in Scotland for holding Protestant beliefs. He was from a noble family, and was distantly related to King James V. Hamilton was an able scholar and studied in Paris and St Andrews. In the mid 1520s he composed a Catholic mass for nine voices which was performed in St Andrews Cathedral.",
      "Early in 1527 the Scottish Catholic authorities started to suspect Hamilton of holding unorthodox religious views and he went into exile in Germany. While in exile Hamilton was based at the University of Marburg, where he published in Latin a number of Reformist ideas. Hamilton’s work was later translated into English, and became known as Patrick’s Places.",
      "During the winter of 1527 Hamilton returned to Scotland. He was summoned to St Andrews in January 1528, where he was initially allowed to teach in the university (possibly to enable the Catholic leadership to gather evidence against him). After a short while Archbishop James Beaton put Hamilton on trial for heresy. Hamilton was condemned to death on the morning of 29 February 1528 and burnt at the stake that afternoon outside the gates of St Salvator’s College. His execution was badly mishandled. It was a wet day and the fire did not burn properly. According to one account Hamilton took six hours to die and was ‘more roasted than burnt’."
    ],
    "references": [
      "King James V",
      "Cathedral",
      "Archbishop James Beaton"
    ]
  },
  {
    "name": "Walter Mylne",
    "summary": "",
    "text": [
      "Walter Mylne was the last Protestant to be executed for heresy on the orders of the Scottish Catholic Church. Mylne was himself originally a Catholic priest, serving for many years at Lunan in Angus. In the 1530s Mylne developed Reformist sympathies, leading Cardinal David Beaton to accuse him of heresy. Mylne fled to Germany, where he married, before returning to Scotland in 1556.",
      "In the late 1550s Mylne seems to have been quietly spreading Protestant views in Fife. He was arrested at Dysart in April 1558 and taken to St Andrews where he was tried for heresy on the instructions of Archbishop John Hamilton. At this stage Mylne was in his eighties. Before his trial Mylne was imprisoned in St Andrews Castle, where he was kept in poor conditions and threatened with torture. By the time Mylne was brought to the Cathedral for public interrogation he was so frail he was struggling to walk unaided. Despite his infirmities Mylne spoke passionately at his trial, and made scathing criticisms of the sexual immorality of bishops and the ‘whoredom’ which he claimed accompanied pilgrimages.",
      "Mylne was condemned by the church courts. However the provost of St Andrews, Sir Patrick Lermonth (who would traditionally have been responsible for organising the death of heretics) refused to execute him. Eventually one of Archbishop Hamilton’s household undertook the co-ordination of Mylne’s execution. The decision to kill Mylne was deeply unpopular within the St Andrews community, and local tradesmen refused to provide the executioners with tar and rope. Nevetheless, Mylne was still burnt at the stake on 28 April 1558. He was killed just outside the gates of St Andrews Cathedral, perhaps near the entrance to Dean’s Court. Following Mylne’s death local people piled stones on the site of his execution, to the great annoyance of the Catholic authorities."
    ],
    "references": [
      "Cardinal David Beaton",
      "Archbishop John Hamilton",
      "Castle",
      "Cathedral",
      "Sir Patrick Lermonth",
      "Dean’s Court"
    ]
  },
  {
    "name": "George Wishart",
    "summary": "",
    "text": [
      "George Wishart was a radical Protestant preacher and activist. He graduated from Louvain (in what is now Belgium) in 1532. Wishart was ordained as a Catholic priest, but by the late 1530s was expressing Reformist sympathies. In 1538 he fled Scotland, and travelled to Bristol in England. While living in Bristol it was alleged that Wishart  preached ‘the most blasphemous heresy that ever was heard’.",
      "After a number of difficulties with the English authorities Wishart seems to have moved to mainland Europe, where he seems to have been influenced by the radical forms of Protestantism developing in Switzerland. However, by 1542 Wishart was back in England, and teaching at Corpus Christi College in Cambridge.",
      "In 1543 Wishart returned to Scotland where he began a campaign of Reformist preaching. He soon acquired an enthusiastic following (including a young John Knox). Wishart was an inspiring public speaker and attracted large crowds to his sermons. One one occasion Wishart preached for three hours in a field in Mauchline in Ayrshire, where he proclaimed that ‘Christ Jesus is as potent upon the fields as in the kirk’.",
      "Unsurprisingly Scotland’s Catholic leaders were alarmed by Wishart’s popularity. In 1545 Wishart survived an assassination attempt, supposedly ordered by Cardinal David Beaton, then archbishop of St Andrews. Wishart was arrested not long after. He was tried for heresy in St Andrews Cathedral on 1 May 1546, and executed outside St Andrews Castle. Wishart was hanged then burnt. The execution was watched by Cardinal Beaton, who supposedly gave orders for the guns of the castle to be pointed at the crowd who came to see Wishart die."
    ],
    "references": [
      "John Knox",
      "Cardinal David Beaton",
      "Castle",
      "Cathedral"
    ]
  },
  {
    "name": "King James V",
    "summary": "",
    "text": [
      "James V was king of Scots between 1513 and 1542. He came to the throne when he was a year old, following the death of his father James IV at the Battle of Flodden. His childhood saw a number of power struggles between the various members of the Scottish royal family and nobility who were attempting to rule on his behalf.",
      "In his mid teens James decided to take a more active role in politics, and in 1529 succeeded in removing his guardian, the Earl of Angus from power. From this point onwards James V seems to have been anxious to present himself as a powerful and cultured European monarch. James V had numerous connections to St Andrews, and spent extended periods of time in the burgh. In 1538 he chose St Andrews as the place to welcome his new second wife, Mary of Guise, to Scotland – an occasion which was marked with services in St Andrews Cathedral, a procession around the city, and several weeks of feasting and celebrations. James and Mary’s short-lived eldest son (also called James) was born in St Andrews in May 1540. The king also made his illegitimate son, Lord James Stewart, prior of St Andrews Cathedral in 1538.",
      "James’s religious policy was complicated. On the one hand he made efforts to extend royal control over church finance and administration. He also appears to have enjoyed anti-clerical satires, and have tolerated Protestant sympathisers at his court. Yet on the other hand he never broke with the Catholic church, he gave leading roles in his government to Catholic churchmen (including Cardinal David Beaton), he legislated against heresy, and he actively pursued closer relations with France (one of Europe’s major Catholic powers).",
      "James died unexpectedly of illness in December 1542, shortly after the Scots had suffered a major defeat by the English at Solway Moss. He left a problematic legacy in both religion and foreign affairs for the advisors of his infant daughter Mary Queen of Scots to address – their struggles to rise to the challenge arguably contributed to the outbreak of religious war in sixteenth-century Scotland."
    ],
    "references": [
      "Mary of Guise",
      "Cathedral",
      "Lord James Stewart",
      "Cardinal David Beaton",
      "Mary Queen of Scots"
    ]
  }
]
