[
  {
    "name": "Castle",
    "lat": 56.342248,
    "lon": -2.790009,
    "image": "images/places/castle.jpg",
    "icon": "images/icons/place.png",
    "summary": "St Andrews Castle was home to the Catholic archbishops of St Andrews.",
    "text": [
      "St Andrews Castle was home to the Catholic archbishops of St Andrews. A number of leading Protestants were imprisoned here before their trials inSt Andrews Cathedral. In March 1546 the Reformist preacher George Wishart was hanged and burned outside the castle, in the presence of Cardinal David Beaton. Slightly over two months later, in May 1546, a group of Fife lairds murdered Cardinal Beaton in revenge for Wishart’s execution. Beaton’s assassins took control of the castle, sparking a year-long siege. The remains of a mine and counter-mine from the siege can still be explored today.",
      "The castle was recaptured by French forces in the summer of 1547, and Catholic control of St Andrews was temporarily re-established. During the 1550s Archbishop John Hamilton ordered major building work to repair damage from the siege. Hamilton created the present day entrance to the castle, which is decorated with his family symbol of the cinquefoil (a flower with five petals).",
      "The castle returned to Protestant hands when Archbishop Hamilton fled from St Andrews in June 1559. In the ensuing conflict of the Scottish Reformation, St Andrews Castle became a major Protestant stronghold. It fell into ruins in the seventeenth century."
    ],
    "references": [
      "George Wishart",
      "Cardinal David Beaton",
      "Cathedral",
      "Archbishop John Hamilton"
    ]
  },
  {
    "name": "Cathedral",
    "lat": 56.340041,
    "lon": -2.787755,
    "image": "images/places/cathedral.jpg",
    "icon": "images/icons/place.png",
    "summary": "",
    "text": [
      "Before the Reformation St Andrews Cathedral was the largest religious building in Scotland. It housed the relics of St Andrew (the nation’s patron saint), and was the base for the archbishop of St Andrews (the most important churchman in the kingdom). During the early sixteenth century the Cathedral was the scene of major heresy trials. The last person to be tried for heresy in the Cathedral was the Protestant Walter Mylne, who was condemned to death in April 1558. At the time of his trial Mylne was over eighty years old.",
      "A priory of Augustinian canons was attached to the Cathedral. The canons cared for the shrine of St Andrew and undertook the day to day running of the Cathedral church. St Andrews Cathedral Priory had a complicated relationship with religious reform. On the one hand, the priory was a Catholic religious institution which until 1559 publicly upheld Scotland’s traditional church hierarchy. Yet on the other hand, a number of key figures within the Cathedral Priory were personally sympathetic to religious reform. During the 1550s the sub-prior John Winram supported reformist policies within the Catholic church. Following the Reformation Winram played a major role in the establishment of Protestantism in Fife.  Similarly, the prior of St Andrews Cathedral, Lord James Stewart, became one of the most important leaders of the Protestant cause in Scotland during and after the Reformation of 1559.",
      "In June 1559 Protestant Reformers (inspired by John Knox and supported by Lord James) determined to purge the Cathedral of all ‘monuments of idolatry’. The Reformers smashed statues and altars, and burnt images, vestments and mass books. At this time a number of the Cathedral canons ‘put off their habits’ and openly joined the Protestant cause. After the Reformation the focus of religious activity in St Andrews shifted to the parish church of Holy Trinity, and the Cathedral church was gradually dismantled and abandoned. However, the wider Cathedral site (which included the area now covered by St Leonard’s School) continued to be occupied, and had houses, mills, barns, and gardens into the nineteenth century."
    ],
    "references": [
      "Walter Mylne",
      "John Winram",
      "Lord James Stewart",
      "John Knox",
      "Holy Trinity"
    ]
  },
  {
    "name": "Deans Court",
    "lat": 56.340257,
    "lon": -2.789273,
    "image": "images/places/deans_cort.jpg",
    "icon": "images/icons/place.png",
    "summary": "",
    "text": [
      "Deans Court belonged to the archdeacon of St Andrews – one of the more important churchmen in the diocese of St Andrews. The archdeacon was regarded as the ‘archbishop’s eye’, and was responsible for inspecting parish churches and testing candidates for the priesthood.",
      "In the sixteenth century Deans Court was often referred to as the ‘Archdean’s Inns’ (inn being the traditional term for a large urban residence). The well in the courtyard of the property can be seen on the oldest surviving map of St Andrews (the so-called Geddy Map from about 1580).",
      "At the Reformation the Catholic archdeacon of St Andrews, George Durie, left the city, eventually going into exile in France. Deans Court initially passed to Durie’s relatives, the Pitcairns, but soon changed hands.",
      "Just outside the gates of Deans Court there is a marker in the paving indicating where the Protestant Walter Mylne may have been burnt for heresy in the spring of 1558."
    ],
    "references": [
      "George Durie",
      "Walter Mylne"
    ]
  },
  {
    "name": "Holy Trinity",
    "lat": 56.339630,
    "lon": -2.795471,
    "image": "images/places/holy_trinity.jpg",
    "icon": "images/icons/place.png",
    "summary": "Henry Forrest or Forres, was a Scottish martyr.",
    "text": [
      "The parish church of Holy Trinity was where many of the ordinary residents of St Andrews worshipped. Before the Reformation it housed the altars of the local craft guilds, and about thirty Catholic priests were attached to the church. The priests spent much of their time saying masses for the dead in an effort to speed the souls of pious benefactors through Purgatory (according to Catholic theology the place where souls were ‘purged’ of sin before entering Heaven).",
      "Although founded as a Catholic church, Holy Trinity was the scene of key events in St Andrews’ Reformation. In 1547, during the siege of St Andrews Castle, Holy Trinity became the focus of preaching by Catholics and Protestants, with each side putting forward their interpretation of Christianity. A young John Knox was among the Protestant preachers, and he delivered his first ever public sermon at Holy Trinity – an oration which led some listeners to conclude he would be burnt for heresy!",
      "John Knox returned to Holy Trinity in June 1559, where he preached a fateful sermon persuading the citizens of St Andrews to reject Catholicism and ‘corruption’, and likening their work to Christ driving ‘the buyers and the sellers forth of the Temple of Jerusalem’. This sermon is traditionally seen as the trigger for St Andrews’ official adoption of Protestantism. Knox lived in St Andrews for several months during the Reformation crisis and was briefly minister of Holy Trinity Church.",
      "Following the Reformation Holy Trinity became the focal point for Protestant worship in St Andrews. In 1559 Holy Trinity established one of the earliest kirk sessions in Scotland. The kirk session acted as a local church court and actively worked to enforce Protestant moral values. Offences as wide ranging as expressing Catholic sympathies, failing to attend church on Sunday, drunkenness, adultery, and domestic violence, were dealt with by the kirk session. In May 1564 the St Andrews Kirk Session proudly declared that ‘the face of a perfect reformed kirk has been seen within this city by the space of five years’. However, the sixteenth-century kirk session minutes tell a more complex story of defiance and disagreements."
    ],
    "references": [
      "Castle",
      "John Knox"
    ]
  }
]
