[
  {
    "name": "Keeping Divine Service",
    "summary": "An Agreement on Catholic Worship at Holy Trinity Church from May 1527",
    "introduction": "In May 1527 the priests attached to the parish church of Holy Trinity (on South Street) entered into a contract with the St Andrews burgh council. The contract was mainly concerned with church finance, but also set out rules for what services should be celebrated, and the skills expected of priests. This document provides a remarkable insight into Catholic worship in early sixteenth-century St Andrews, and the religious expectations of the local community.",
    "text": [
      "These indentures made at the city of St Andrews... between...James Learmonth of Dairsie, provost of the said city, David Winchester, David Graham, Master Bernard Crawford, and John Trail, bailies of the said city, and council... together with the community of the same on the one part, and Sir Alexander Swinton as procurator of the choir and [the] choristers of the parish kirk of the said city... on the other part...",
      "The said provost, bailies, council, and community... undoubted patrons to the service called the Rood service within the said parish kirk of the said city... present and unite the foresaid Rood service with all the profits thereof freely to the... chaplains, clerk, and choristers of the said parish kirk, to them and their successors perpetually in time coming...",
      "For the which service... the foresaid... choir, chaplains, clerk, and choristers... and their successors... shall sing daily matins, high mass, and evensong, with note of the best fashion... [and] with a mass to be said daily in the Rood loft of the said kirk at five hours in the morning in summer and at six hours in winter...",
      "And the foresaid Sir Alexander and the [rest] of the chaplains [and] choristers... consent... that no priest in time coming be... received in the choir [unless] he can sing plainsong, pricksong, and descant for the honour and upholding of God’s service...",
      "And the said Sir Alexander shall take on him the office called Rector Chori for the good rule and service to be done in the foresaid kirk and choir and the song school...",
      "And the foresaid Sir Alexander shall... keep all divine service in choir and kirk as well as any other Rector Chori does in any parish kirk in Scotland, and shall cause the Lady Mass to be sung as well or better than it has been in times bygone..."
    ],
    "source": "Adapted from W.E.K. Rankin, The Parish Church of the Holy Trinity, St Andrews (Edinburgh, 1955), pp. 133-135."
  },
  {
    "name": "A Place of Execution",
    "summary": "John Knox Describes the Death of Patrick Hamilton in 1528",
    "introduction": "Patrick Hamilton was executed outside the gates of St Salvator’s College (also known as the Old College) on 29 February 1528. He was the first person to be killed in Scotland for spreading Protestant ideas. Hamilton served as an inspiration to later generations of Reformers such as John Knox – who included the following narrative in his ‘History of the Reformation in Scotland’. Knox was not himself present at Hamilton’s death, but drew on earlier sixteenth-century descriptions of the execution. Knox’s version of events also has parallels with biblical accounts of Christ’s crucifixion.",
    "text": [
      "Immediately after dinner the fire was prepared before the Old College, and [Patrick Hamilton was] led to the place of execution...",
      "At the place of execution he gave to his servant (who had been chamber-child to him of a long time) his gown, his coat, bonnet, and such like garments, saying, ‘These will not profit in the fire; they will profit thee...’",
      "The innocent servant of God being bound to the stake in the midst of some coals, some timber, and other matter appointed for the fire, a train of [gun]powder was made and set afire, which gave to the blessed martyr of God a glaze, [scorched] his left hand, and that side of his face, but neither kindled the wood, nor yet the coals.",
      "And so remained the appointed to death in torment until men ran to the Castle again for more powder, and for wood more able to take fire, which at last being kindled, with a loud voice he cried, ‘Lord Jesus, receive my spirit! How long shall darkness overwhelm this realm? And how long wilt thou suffer this tyranny of men?’",
      "The fire was slow, and therefore was his torment the more."
    ],
    "source": "Adapted from William Croft Dickinson, ed., John Knox’s History of the Reformation in Scotland (New York, 1950), pp. 13-14."
  },
  {
    "name": "Slain in the Castle of St Andrews",
    "summary": "The Death of Cardinal David Beaton in May 1546",
    "introduction": "On 29 May 1546 Cardinal David Beaton was murdered in St Andrews Castle by a group of Fife lairds who were sympathetic to religious reform. The assassins were able to get into the Castle because the gates were open to allow builders and other workmen to come and go. Cardinal Beaton’s death sent shock waves around Europe. In the immediate aftermath of the murder James Lyndesay sent the following letter to an unnamed person who was probably working for the English government. ",
    "text": [
      "Sir... this Saturday, betwixt five hours and six in the morning, the Cardinal is slain in the Castle of St Andrews by Norman Leslie in this manner.",
      "At the coming in of the masons and workmen... to their work, Norman Leslie (and three with him) entered, and after them James Melville (and three men with him) [pretended to wish to speak] with the Cardinal. And after them came the young laird of Grange and eight men with him all in gear [of war], which the porter stopped to let in, [so] one of them struck [the porter] with a knife and cast him into the fosse.",
      "[Straightaway] they [drove out] all the workmen and closed the gate, then sought the chamber [servants] and [drove out] all the household men...",
      "The Cardinal, hearing the din in his chamber, came forth and was passing to the blockhouse head to seek what it was. Norman Leslie and his company met him in the [staircase] ... and slew him.",
      "And after they have despatched the place of all men [excepting] the governor’s son, his priest and servant, and the Cardinal’s chamber child, the... bell of the town rang, the provost and town gathered to the number of three or four hundred men and came to the castle, while Norman Leslie and his company came to the wall head and [asked whether] they desired to see a dead man.",
      "[Immediately] they brought the Cardinal dead to the wall head, in a pair of sheets, and hung him over the wall by one arm and one foot, and bade the people see their God..."
    ],
    "source": "Adapted from National Archives, SP 49/9, f. 1."
  },
  {
    "name": "Burning Idols",
    "summary": "John Knox Describes Events in St Andrews in June 1559",
    "introduction": "On 23 June 1559 the Protestant leader John Knox wrote to his friend Anna Lock (a religious author who lived in London) updating her on recent events in Scotland.",
    "text": [
      "Ye hunger, I doubt not, dear sister, to know... the things that have come to pass since my arrival, and my expectation in this enterprise...",
      "The Queen and her Council made promise that no person within St Johnston... should be troubled for anything done... until the sentence of the Estates in Parliament had decided the controversy... But after she had obtained her desire all Godly promises were forgotten...",
      "This cruelty and deceit displeased many who before assisted her with their presence and counsel, and among others the Earl of Argyll and the Prior of St Andrews left her and joined themselves to the Congregation openly...",
      "At their commandment, I repaired... to St Andrews, where consultation [being] had, it was concluded that Christ Jesus should there be openly preached, that the places and monuments of idolatry should be removed, and that superstitious habits should be changed. This reformation there was begun the 14th of June.",
      "In the meantime came the Bishop of St Andrews to the town, accompanied with a great band of warriors, and gave a straight commandment that no preaching should be made by me, who was both burnt in [effigy] and [outlawed], assuring the Lords that if they suffered me to preach that twelve hackbuts should light upon my nose at once...",
      "But as that boast did little afear me, so did it more incense and inflame with courage the hearts of the Godly, who with one voice proclaimed that Christ Jesus should be preached in despite of Satan. And so that Sabbath and three days after I did occupy the public place in the midst of the Doctors, who to this day are dumb, even as dumb as their idols who were burnt in their presence.",
      "The Bishop departed to the Queen frustrated of his intent, for he had promised to bring me to her either living or dead. And [directly] was a new army assembled, and forward they marched against St Andrews.",
      "It was not thought expedient that we should abide them lurking in a town, and so we passed to the fields, and met them at Cupar...",
      "When both the armies were in sight of [each] other, within shot of cannon, and we looked for nothing but for the extremity of battle... there came from our adversaries an ambassador desiring speech... after long reasoning the Queen offered [the Congregation] a free remission for all crimes past, so [long as] they would no further proceed against friaries and abbeys, and that no more preaching should be used publicly.",
      "But the Lords and the whole brethren refused such appointment, declaring that the fear of no mortal creature should cause them to betray the Verity known and professed...",
      "The adversaries perceiving that neither threatening, flattery, nor deceit could break the bold constancy and godly purpose of the lords, barons, gentlemen, and commons... were content to take assurance [of peace] for eight days, permitting unto us freedom of religion in the meantime.",
      "In the while, the Abbey of Lindores, a place of black monks distant from St Andrews [by about] twelve miles, was reformed, their altars overthrown, their idols, vestments of idolatry, and mass books were burnt in their own presence, and they [were] commanded to cast away their monkish [habits]. Diverse canons of St Andrews have [also] given notable confessions, and have declared themselves manifest enemies to the Pope, to the mass, and to all superstition.",
      "Thus far has God advanced the glory of his dear Son amongst us... The long thirst of my wretched heart is satisfied in abundance that is above my expectation..."
    ],
    "source": "Adapted from D. Laing, ed., The Works of John Knox  (Edinburgh, 1895), vol. 6, pp. 21-26."
  },
  {
    "name": "Spoiling Goodly Things",
    "summary": "Lord Herries Remembers the Upheavals of June 1559",
    "introduction": "In the 1570s the Scottish nobleman Lord Herries wrote about his memories of the reign of Mary Queen of Scots. Although Herries was a Protestant, he was sympathetic to Mary and was critical of people such as John Knox and Lord James Stewart who helped depose her in 1567. Herries’ suspicion of Knox and Lord James can be detected in his description of Protestant activity in Fife in June 1559.",
    "text": [
      "When the news was known that Lord James and the Earl of Argyll had deserted... and joined themselves to the Congregation, the people were so much encouraged that they flocked in multitudes.",
      "Then a declaration was put out [by the Reformers], by which it was declared that the cause of their rising in arms was for defence of the cause of God, their religion, and liberty, and lives, that were all in eminent danger by the false dealing of [the] Queen Regent [Mary of Guise, mother to Mary Queen of Scots] whom neither bands, religion, nor solemn oaths could bind. [It was claimed] that she was a stranger that had no respect to the [good] of Scotland.",
      "These words being declared to the people by John Knox they grew so exasperate that they were ready to attempt anything. They ran in confusion to the town of Crail and fell upon the church, which they ransacked and spoiled. From thence to St Andrews, and here they spoiled all. And, not content with the spoil of the whole churches and monasteries, they pulled down the very walls of the grey and black friars’ monasteries, goodly things and of great antiquity, and chased the archbishop himself out of the town."
    ],
    "source": "Adapted from R. Pitcairn, ed., Historical Memoirs of the Reign of Mary Queen of Scots, and a Portion of the Reign of James the Sixth, by Lord Herries (Edinburgh, 1836), p. 40."
  },
  {
    "name": "Rejecting Tradition",
    "summary": "Friar John Grierson Publicly Renounces Catholicism, March 1560",
    "introduction": "Following St Andrews’ official adoption of Protestantism in the summer of 1559 local residents were pressured to join the Reformed Kirk. Catholics who refused to accept the religious changes were prosecuted by the Kirk Session (which enforced Protestant moral values within the St Andrews community). In March 1560 Friar John Grierson, the former head of the Dominican Order in Scotland, publicly renounced Catholicism in front of the congregation at Holy Trinity Church. Grierson’s recantation was recorded in the St Andrews Kirk Session minutes.",
    "text": [
      "Here, in presence of almighty...God and of this holy congregation, I grant and confess that in times bypast I have maintained and defended diverse kinds of superstition and idolatry... and repent the same from the bottom of my heart, and [am] content in time to come to institute and conform my life to the word and doctrine of the eternal God set forth... in the Old Testament and the New... and therefore I reject, renounce and abhor all other doctrines and traditions of men...",
      "And in special I renounce the Pope to be head of the Kirk, and also I renounce him and all his traditions and laws...",
      "Item I renounce the mass as it has been used in times bypast, and the... invented purgatory, as pestiferous... and as contrary... to the merits, death, passion, and omnisufficient sacrifice offered upon the cross by our Saviour Christ for the redemption of mankind.",
      "Item I grant that no graven image should be made and worshipped in the Kirk of God, and that no honour should be given thereto, and that all exhibition of such honour... to such stocks and stones is... idolatry and against the express command of God.",
      "Item I grant that we have no command of God bidding us pray to any saints that are departed, but only to him who is saint of saints, viz. Christ Jesu, our only Saviour, Mediator, and Advocate... And [similarly] I grant that we have no command to pray for them that are departed.",
      "Item... I grant... that it is lawful to all men and women to marry... notwithstanding any vow made to the contrary... [indeed if] they be vexed [with] urgent appetites of the flesh they are bound by the commandment of the apostle to marry.",
      "Item I deny all transubstantiation in the sacrament of the body and blood of our Saviour Christ Jesus, and [deny] that auricular confession is necessary for the salvation of man.",
      "These foresaid (and all other ungodly opinions and inventions of men)... I detest, abhor, and renounce, for now and ever. And of my long adherence to the same I ask God mercy, and this...holy congregation forgiveness."
    ],
    "source": "Adapted from D. Hay Fleming, ed., Register of the Minister, Elders and Deacons of the Christian Congregation of St Andrews (Edinburgh, 1889), vol. 1, pp. 16-18"
  }
]